SparkEVO/SparkEVO-ArduinoCore-tinyAVR/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
sparkevo_zeroabs.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
sparkevo_zeroabs.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
sparkevo_zeroabs.bootloader.OSCCFG=0x01
sparkevo_zeroabs.bootloader.TCD0CFG_avrdude=
sparkevo_zeroabs.bootloader.TCD0CFG_serialupdi=
sparkevo_zeroabs.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
sparkevo_zeroabs.bootloader.APPEND=0x00
sparkevo_zeroabs.bootloader.BOOTEND=0x00
sparkevo_zeroabs.bootloader.resetpinbits=01
sparkevo_zeroabs.bootloader.avrdudestring=
sparkevo_zeroabs.bootloader.serialupdistring=-aerase
sparkevo_zeroabs.bootloader.tool=avrdude
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
sparkevo_zeroabs.build.bootload=
sparkevo_zeroabs.build.printfabr=
sparkevo_zeroabs.build.attachabr=
sparkevo_zeroabs.build.wireabr=
sparkevo_zeroabs.build.pwmabr=6
#sparkevo_zeroabs.build.optabr=.Os

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
sparkevo_zeroabs.upload.tool=avrdude
sparkevo_zeroabs.upload.workaround=
sparkevo_zeroabs.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
sparkevo_zeroabs.menu.chip.814=ATtiny814
sparkevo_zeroabs.menu.chip.814.build.board=AVR_ATtiny814
sparkevo_zeroabs.menu.chip.814.build.attiny=814
sparkevo_zeroabs.menu.chip.814.upload.maximum_size=8192
sparkevo_zeroabs.menu.chip.814.build.mrelax=
sparkevo_zeroabs.menu.chip.814.upload.maximum_data_size=512
sparkevo_zeroabs.menu.chip.814.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
sparkevo_zeroabs.menu.chip.814.bootloader.TCD0CFG_serialupdi=4:0x00

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
sparkevo_zeroabs.menu.clock.16internal=16 MHz internal
sparkevo_zeroabs.menu.clock.16internal.build.speed=16
sparkevo_zeroabs.menu.clock.16internal.build.clocksource=0

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
sparkevo_zeroabs.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
sparkevo_zeroabs.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
sparkevo_zeroabs.menu.bodmode.enabled=Enabled/Enabled
sparkevo_zeroabs.menu.bodmode.enabled.bootloader.bodmodebits=00101

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
sparkevo_zeroabs.menu.eesave.enable=EEPROM retained
sparkevo_zeroabs.menu.eesave.enable.bootloader.eesavebit=1

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
sparkevo_zeroabs.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
sparkevo_zeroabs.menu.millis.timerd.build.millistimer=B0

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#sparkevo_zeroabs.menu.resetpin.UPDI=UPDI (no reset pin)
#sparkevo_zeroabs.menu.resetpin.UPDI.bootloader.resetpinbits=01
#sparkevo_zeroabs.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#sparkevo_zeroabs.menu.resetpin.reset.bootloader.resetpinbits=10
#sparkevo_zeroabs.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#sparkevo_zeroabs.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
sparkevo_zeroabs.menu.startuptime.16=16ms
sparkevo_zeroabs.menu.startuptime.16.bootloader.SYSCFG1=0x05

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
sparkevo_zeroabs.menu.wiremode.mors=Master or Slave (saves flash and RAM)
sparkevo_zeroabs.menu.wiremode.mors.build.wire=MORS

#----------------------------------------#
# printf() version options               #
#________________________________________#
sparkevo_zeroabs.menu.printf.default=Default (doesn't print floats, 1.4k flash use)

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
sparkevo_zeroabs.menu.PWMmux.default=PB0-2, PA3-5 (default)
sparkevo_zeroabs.menu.PWMmux.default.build.pwmabr=6

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
sparkevo_zeroabs.menu.attach.allenabled=On all pins, with new implementation.
sparkevo_zeroabs.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
sparkevo_zeroabs.menu.WDTtimeout.disabled=Disabled (recommended)
sparkevo_zeroabs.menu.WDTwindow.disabled=No delay before window "opens"
sparkevo_zeroabs.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
sparkevo_zeroabs.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
